tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/2DGrainstonesMultiphaseReactiveTransport/system/fvSchemes1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
    nHat            pointCellsLeastSquares;
}

divSchemes
{
    div(rhoPhi,U)  Gauss SFCD;
    div(phi,alpha)   Gauss vanLeer;
    div(phi,Yi)      Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression;
    div(phiH,Yi)     Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
